УТ/src/InformationRegisters/CRM_АвтоответчикПочты/CRM_АвтоответчикПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_АвтоответчикПочты</name>
  <resources>
    <name>Включена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТемаОтвета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстПисьмаHTML</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Enums/CRM_ВидыПапокЭлектроннойПочты/CRM_ВидыПапокЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыПапокЭлектроннойПочты</name>
  <enumValues>
    <name>Входящие</name>
  </enumValues>
  <enumValues>
    <name>Обработанные</name>
  </enumValues>
  <enumValues>
    <name>Черновики</name>
  </enumValues>
  <enumValues>
    <name>Исходящие</name>
  </enumValues>
  <enumValues>
    <name>Отправленные</name>
  </enumValues>
  <enumValues>
    <name>Удаленные</name>
  </enumValues>
  <enumValues>
    <name>НежелательнаяПочта</name>
  </enumValues>
</mdclass:Enum>

УТ/src/Documents/ЭлектронноеПисьмоИсходящее/ЭлектронноеПисьмоИсходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектронноеПисьмоИсходящее</name>
  <basedOn>Document.Встреча</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <basedOn>Document.ЗапланированноеВзаимодействие</basedOn>
  <basedOn>Document.СообщениеSMS</basedOn>
  <basedOn>Document.КоммерческоеПредложениеКлиенту</basedOn>
  <basedOn>Document.CRM_Интерес</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоИсходящее</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийЗаголовок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщенияОтправкаIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторыОснований</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПредставление</name>
    <comment>Текстовое описание отправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейКопий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейСкрытыхКопий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПисьма</name>
    <type>
      <types>EnumRef.СтатусыИсходящегоЭлектронногоПисьма</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимодействиеОснование</name>
    <type>
      <types>DocumentRef.РассылкаКлиентам</types>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.Встреча</types>
      <types>DocumentRef.СообщениеSMS</types>
      <types>CatalogRef.ВидыОповещенийКлиентам</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьТелоИсходногоПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьТелоИсходногоПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПослеОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКогдаОтправить</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальностиОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИдентификаторСообщенияОтправкаIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_АдресХранилищаФайлов</name>
    <comment>Служебный реквизит, используется для механизма шаблонов</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Избранный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтправительАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтправительКонтакт</name>
    <type>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Предмет</name>
    <type>
      <types>DefinedType.ПредметВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РассылкаИзменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьВАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ТипОтвета</name>
    <type>
      <types>EnumRef.CRM_ТипыОтвета</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЭтоАвтоОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Папка</name>
    <type>
      <types>CatalogRef.ПапкиЭлектронныхПисем</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиОтвета</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкрытыхКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НепринятыеВложения</name>
    <attributes>
      <name>ИмяВложение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПисьмаВложения</name>
    <attributes>
      <name>Письмо</name>
      <type>
        <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
        <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомерВоВложениях</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ/src/InformationRegisters/CRM_АвтоответчикПочты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура выполняет проверку и отправку письма автоответчика.
//
// Параметры:
//  ПолученныеПисьма - Массив	 - Полученные письма.
//  УчетнаяЗапись	 - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты	 - Учетная запись.
//
Процедура ВыполнитьПроверкуИОтправкуПисьмаАвтоответчика(ПолученныеПисьма, УчетнаяЗапись) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПолученныеПисьма.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПериодСутокМеждуАвтоответами = 3;
	СекундВСутках = 86400;
	
	ЗаписьАвтоответчика = РегистрыСведений.CRM_АвтоответчикПочты.СоздатьМенеджерЗаписи();
	ЗаписьАвтоответчика.УчетнаяЗапись = УчетнаяЗапись;
	ЗаписьАвтоответчика.Прочитать();
	
	Если Не ЗаписьАвтоответчика.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗаписьАвтоответчика.Включена Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	ДатаНачалаРаботыАвтоответчика	= ЗаписьАвтоответчика.ДатаНачала;
	Если ЗначениеЗаполнено(ЗаписьАвтоответчика.ДатаЗавершения) Тогда
		ДатаКонцаРаботыАвтоответчика = КонецДня(ЗаписьАвтоответчика.ДатаЗавершения);
	Иначе
		ДатаКонцаРаботыАвтоответчика = КонецДня(Дата('39991231'));
	КонецЕсли;
	
	Если ТекущаяДата < ДатаНачалаРаботыАвтоответчика
			Или ТекущаяДата > ДатаКонцаРаботыАвтоответчика Тогда
		Возврат;
	КонецЕсли;
	
	СлужебныйПользователь = CRM_ОбщегоНазначенияПовтИсп.СлужебныйПользовательРобот();
	
	ЗапросОтправленныеАвтоответы = Новый Запрос(
	"ВЫБРАТЬ
	|	ЭлектронноеПисьмоИсходящееПолучателиПисьма.Адрес КАК Адрес,
	|	МАКСИМУМ(ЭлектронноеПисьмоИсходящее.Дата) КАК Дата
	|ИЗ
	|	Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронноеПисьмоИсходящее.ПолучателиПисьма КАК ЭлектронноеПисьмоИсходящееПолучателиПисьма
	|		ПО (ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка = ЭлектронноеПисьмоИсходящее.Ссылка)
	|ГДЕ
	|	ЭлектронноеПисьмоИсходящее.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЭлектронноеПисьмоИсходящее.УчетнаяЗапись = &УчетнаяЗапись
	|	И ЭлектронноеПисьмоИсходящее.CRM_ЭтоАвтоОтвет
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭлектронноеПисьмоИсходящееПолучателиПисьма.Адрес");
	
	ЗапросОтправленныеАвтоответы.Параметры.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ЗапросОтправленныеАвтоответы.Параметры.Вставить("ДатаНачала", ДатаНачалаРаботыАвтоответчика);
	ЗапросОтправленныеАвтоответы.Параметры.Вставить("ДатаОкончания", ДатаКонцаРаботыАвтоответчика);
	
	ВыборкаАвтоответы = ЗапросОтправленныеАвтоответы.Выполнить().Выбрать();
	
	ЗапросПолученныеПисьма = Новый Запрос(
	"ВЫБРАТЬ
	|	ЭлектронноеПисьмоВходящее.Ссылка КАК Ссылка,
	|	ЭлектронноеПисьмоВходящее.ОтправительАдрес КАК Адрес
	|ИЗ
	|	Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее
	|ГДЕ
	|	ЭлектронноеПисьмоВходящее.Ссылка В(&ПолученныеПисьма)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭлектронноеПисьмоВходящее.Дата
	|ИТОГИ ПО
	|	Адрес");
	
	ЗапросПолученныеПисьма.Параметры.Вставить("ПолученныеПисьма", ПолученныеПисьма);
	ВыборкаОтправители = ЗапросПолученныеПисьма.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОтправители.Следующий() Цикл
		ВыборкаПисьма = ВыборкаОтправители.Выбрать();
		Если ВыборкаПисьма.Следующий() Тогда
			
			Если ВыборкаАвтоответы.НайтиСледующий(ВыборкаОтправители.Адрес, "Адрес") Тогда
				Если (ТекущаяДата - ВыборкаАвтоответы.Дата) > ПериодСутокМеждуАвтоответами * СекундВСутках Тогда
					СоздатьПисьмоАвтоответ(ВыборкаПисьма.Ссылка, УчетнаяЗапись, ТекущаяДата,
						СлужебныйПользователь, ЗаписьАвтоответчика);
				КонецЕсли;
				ВыборкаАвтоответы.Сбросить();
			Иначе
				СоздатьПисьмоАвтоответ(ВыборкаПисьма.Ссылка, УчетнаяЗапись, ТекущаяДата,
					СлужебныйПользователь, ЗаписьАвтоответчика);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьПисьмоАвтоответ(ПолученноеПисьмо, УчетнаяЗапись, Дата, Пользователь, ЗаписьАвтоответчика)
	
	НачатьТранзакцию();
	
	Попытка
	
		ПисьмоАвтоответчика = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
		
		ПисьмоАвтоответчика.Дата						= Дата;
		ПисьмоАвтоответчика.УчетнаяЗапись				= УчетнаяЗапись;
		ПисьмоАвтоответчика.ОтправительПредставление	= ПисьмоАвтоответчика.УчетнаяЗапись.Наименование;
		ПисьмоАвтоответчика.Ответственный				= Пользователь;
		ПисьмоАвтоответчика.Автор						= Пользователь;
		ПисьмоАвтоответчика.Важность					= Перечисления.ВариантыВажностиВзаимодействия.Обычная;
		ПисьмоАвтоответчика.СтатусПисьма				= Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Исходящее;
		ПисьмоАвтоответчика.Кодировка					= "utf-8";
		ПисьмоАвтоответчика.ТипТекста					= Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
		ПисьмоАвтоответчика.СписокПолучателейПисьма		= ПолученноеПисьмо.ОтправительПредставление;
		ПисьмоАвтоответчика.CRM_ТипОтвета				= Перечисления.CRM_ТипыОтвета.ОтветНаПисьмо;
		
		ПисьмоАвтоответчика.CRM_Предмет					= ПолученноеПисьмо;
		ПисьмоАвтоответчика.ВзаимодействиеОснование		= ПолученноеПисьмо;
		ПисьмоАвтоответчика.ИдентификаторОснования		= ПолученноеПисьмо.ИдентификаторСообщения;
		ПисьмоАвтоответчика.ИдентификаторыОснований		= СокрЛП(
			ПолученноеПисьмо.ИдентификаторыОснований + " <" + ПолученноеПисьмо.ИдентификаторСообщения + ">");
		
		ПисьмоАвтоответчика.Тема		= ЗаписьАвтоответчика.ТемаОтвета;
		ПисьмоАвтоответчика.ТекстHTML	= ЗаписьАвтоответчика.ТекстПисьмаHTML;
		
		ПисьмоАвтоответчика.CRM_ЭтоАвтоОтвет = Истина;
		
		CRM_Взаимодействия.ДобавитьТекстИсходногоПисьма(ПисьмоАвтоответчика.ТекстHTML, ПолученноеПисьмо, ПолученноеПисьмо);
		
		НоваяСтрокаПолучателей = ПисьмоАвтоответчика.ПолучателиПисьма.Добавить();
		НоваяСтрокаПолучателей.Адрес			= ПолученноеПисьмо.ОтправительАдрес;
		НоваяСтрокаПолучателей.Представление	= ПолученноеПисьмо.ОтправительПредставление;
		НоваяСтрокаПолучателей.Контакт			= ПолученноеПисьмо.ОтправительКонтакт;
		
		ПисьмоАвтоответчика.Записать();
		
		ПапкаУчетнойЗаписи = CRM_УправлениеЭлектроннойПочтой.ПапкаУчетнойЗаписи(
			УчетнаяЗапись, Перечисления.CRM_ВидыПапокЭлектроннойПочты.Исходящие);
		
		Взаимодействия.УстановитьПапкуЭлектронногоПисьма(ПисьмоАвтоответчика.Ссылка, ПапкаУчетнойЗаписи, Ложь);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось записать автоответ на письмо %1 от %2, отправленное c адреса %3, по причине:
					|%4'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			ПолученноеПисьмо.Тема, ПолученноеПисьмо.Дата, ПолученноеПисьмо.ОтправительАдрес,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
			CRM_УправлениеЭлектроннойПочтой.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ТекстСообщенияОбОшибке);
		
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
